Revit 2026 API

# ParameterFilterElementAllRuleParametersApplicable(Document, ICollectionElementId, ElementFilter) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AllRuleParametersApplicable(
	Document aDocument,
	ICollection<ElementId> categories,
	ElementFilter elementFilter
)
```
```vb
Public Shared Function AllRuleParametersApplicable (
	aDocument As Document,
	categories As ICollection(Of ElementId),
	elementFilter As ElementFilter
) As Boolean
```
```cpp
public:
static bool AllRuleParametersApplicable(
	Document^ aDocument,
	ICollection<ElementId^>^ categories,
	ElementFilter^ elementFilter
)
```
```fsharp
static member AllRuleParametersApplicable :
        aDocument : Document *
        categories : ICollection<ElementId> *
        elementFilter : ElementFilter -> bool
```

#### Parameters

aDocument Document

categories ICollectionElementId

elementFilter ElementFilter

#### Return Value

Boolean

#### Reference

ParameterFilterElement Class

AllRuleParametersApplicable Overload

Autodesk.Revit.DB Namespace